//--------------------------------------------------------------------------------
//  transform component
//  トランスフォームコンポネント
//  位置情报组件
//
//  Autor  : 徐 文杰(Wenjie Xu)
//  Github : kodfreedom
//  Email  : kodfreedom@gmail.com
//--------------------------------------------------------------------------------
#include "transform.h"
using namespace KeepFortissimo;

//--------------------------------------------------------------------------------
//
//  Public
//
//--------------------------------------------------------------------------------
//  constructor
//  コンストラクタ
//  构造函数
//--------------------------------------------------------------------------------
Transform::Transform(Entity& owner)
    : Component(owner)
{
    
}
