//--------------------------------------------------------------------------------
//  GameTimer
//  時間管理システム
//  游戏内时间管理系统
//
//  Autor  : 徐 文杰(Wenjie Xu)
//  Github : kodfreedom
//  Email  : kodfreedom@gmail.com
//--------------------------------------------------------------------------------
#pragma once
#include <Windows.h>
#include "../Utilities/singleton.h"

namespace KeepFortissimo
{
    class GameTimer : public Singleton<GameTimer>
    {
        friend class Singleton<GameTimer>;

    public:
        //--------------------------------------------------------------------------------
        //  delta time between the last two frames
        //  Return：delta time(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  フレーム間の経過時間
        //  戻り値：delta time(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  两帧之间的经过时间
        //  返回值：delta time(float)
        //--------------------------------------------------------------------------------
        float DeltaTime() const { return m_delta_time; }

        //--------------------------------------------------------------------------------
        //  Get the time scale value
        //  Return：time scale(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  タイムスケールの取得
        //  戻り値：time scale(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  取得时间快慢系数
        //  返回值：time scale(float)
        //--------------------------------------------------------------------------------
        float TimeScale() const { return m_time_scale; }

        //--------------------------------------------------------------------------------
        //  Set the time scale value
        //  Arguments : time scale(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  タイムスケールの設定
        //  引数 : time scale(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  设定时间快慢系数
        //  参数 : time scale(float)
        //--------------------------------------------------------------------------------
        void SetTimeScale(const float time_scale) { m_time_scale = time_scale; }

        //--------------------------------------------------------------------------------
        //  Get the scaled delta time
        //  Return：scaled delta time(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  タイムスケールに掛けたデルタタイムの取得
        //  戻り値：scaled delta time(float)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  取得与快慢系数相乘之后的时间间隔
        //  返回值：scaled delta time(float)
        //--------------------------------------------------------------------------------
        float ScaledDeltaTime() const { return m_scaled_delta_time; }

        //--------------------------------------------------------------------------------
        //  Set the fps limit (unlimited if 0)
        //  Arguments : fps limit(u32)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  fps制限の設定（0 : リミットがない）
        //  引数 : fps limit(u32)
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  设定FPS限制（0则无限制）
        //  参数 : fps limit(u32)
        //--------------------------------------------------------------------------------
        void SetFpsLimit(const u32 fps_limit);

        //--------------------------------------------------------------------------------
        //  Tick! Tack!
        //  タイム走れ！
        //  让子弹飞！
        //--------------------------------------------------------------------------------
        void Tick();

        //--------------------------------------------------------------------------------
        //  Check if it's time for updating the frame
        //  フレーム更新の時間になったかをチェック
        //  确认是否经过了一定时间以让我们更新下一帧
        //--------------------------------------------------------------------------------
        bool CanUpdateFrame();

    private:
        //--------------------------------------------------------------------------------
        //  constructor
        //  コンストラクタ
        //  构造函数
        //--------------------------------------------------------------------------------
        GameTimer();

        //--------------------------------------------------------------------------------
        //  destructor
        //  デストラクタ
        //  析构函数
        //--------------------------------------------------------------------------------
        ~GameTimer();

        //--------------------------------------------------------------------------------
        //  delete the copy constructor and operator
        //  コピーコンストラクタとオペレーターの削除
        //  删除复制用构造函数与等号
        //--------------------------------------------------------------------------------
        GameTimer(GameTimer const&) = delete;
        void operator=(GameTimer const&) = delete;

        //--------------------------------------------------------------------------------
        //  initialize the instance
        //  初期化処理
        //  初始化
        //--------------------------------------------------------------------------------
        bool Initialize() override;

        //--------------------------------------------------------------------------------
        //  Uninit the instance
        //  インスタンスの終了処理
        //  终了处理
        //--------------------------------------------------------------------------------
        void Uninitialize() override {}

        //--------------------------------------------------------------------------------
        //  const variable / 定数 / 定量
        //--------------------------------------------------------------------------------
        static constexpr u32 sc_default_fps_limit = 120;

        //--------------------------------------------------------------------------------
        //  variable / 変数 / 变量
        //--------------------------------------------------------------------------------
        LARGE_INTEGER m_frequency;
        LARGE_INTEGER m_current_time;
        LARGE_INTEGER m_exec_last_time;
        LARGE_INTEGER m_fps_last_time;
        float         m_delta_time = 0.0f;
        float         m_time_scale = 0.0f;
        float         m_scaled_delta_time = 0.0f;
        float         m_time_interval = 0.0f;
        u32           m_fps_limit = 0;
    };
}