//--------------------------------------------------------------------------------
//  main system
//  メインシステム
//  主系统
//
//  Autor  : 徐 文杰(Wenjie Xu)
//  Github : kodfreedom
//  Email  : kodfreedom@gmail.com
//--------------------------------------------------------------------------------
#pragma once
#include <Windows.h>
#include "../Utilities/singleton.h"
#include "../Utilities/kf_labels.h"

namespace KeepFortissimo
{
    class MainSystem : public Singleton<MainSystem>
    {
        friend class Singleton<MainSystem>;

    public:
        //--------------------------------------------------------------------------------
        //  Create the instance and initialize it
        //  Arguments : HINSTANCE
        //  Return：true when succeeded, else false
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  インスタンスの生成と初期化処理
        //  引数 : HINSTANCE
        //  戻り値：成功したらtrue、失敗したらfalse
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  生成实体并初始化
        //  参数 : HINSTANCE
        //  返回值：成功则返回true、反之返回false
        //--------------------------------------------------------------------------------
        static bool StartUp(HINSTANCE instance_handle);

        //--------------------------------------------------------------------------------
        //  Run the main system
        //  Arguments :
        //  Return：return the message.wparam when is over
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  実行処理
        //  引数 :
        //  戻り値：処理終わったらmessage.wparamを返す
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  主系统实行处理
        //  参数 :
        //  返回值：实行完毕则返回message.wparam
        //--------------------------------------------------------------------------------
        int Run();

        //--------------------------------------------------------------------------------
        //  Get the width of the game window
        //  Arguments :
        //  Return：UINT
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  ウインドウの幅
        //  引数 :
        //  戻り値：UINT
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  主系统实行处理
        //  参数 :
        //  返回值：UINT
        //--------------------------------------------------------------------------------
        UINT Width() const { return width_; }

        //--------------------------------------------------------------------------------
        //  Run the main system
        //  Arguments :
        //  Return：return the message.wparam when is over
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  実行処理
        //  引数 :
        //  戻り値：処理終わったらmessage.wparamを返す
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  主系统实行处理
        //  参数 :
        //  返回值：实行完毕则返回message.wparam
        //--------------------------------------------------------------------------------
        UINT Height() const { return height_; }

        //--------------------------------------------------------------------------------
        //  Run the main system
        //  Arguments :
        //  Return：return the message.wparam when is over
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  実行処理
        //  引数 :
        //  戻り値：処理終わったらmessage.wparamを返す
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  主系统实行处理
        //  参数 :
        //  返回值：实行完毕则返回message.wparam
        //--------------------------------------------------------------------------------
        HWND MainWindowHandle() const { return main_window_handle_; }

        //--------------------------------------------------------------------------------
        //  Manage the window messages
        //  Arguments : HWND
        //              UINT
        //              WPARAM
        //              LPARAM
        //  Return：LRESULT
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  ウインドウメッセージ処理
        //  引数 : HWND
        //         UINT
        //         WPARAM
        //         LPARAM
        //  戻り値：LRESULT
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  窗口消息处理
        //  参数 : HWND
        //         UINT
        //         WPARAM
        //         LPARAM
        //  返回值：LRESULT
        //--------------------------------------------------------------------------------
        LRESULT MsgProc(HWND hwnd, UINT msg, WPARAM wparam, LPARAM lparam);

    private:
        //--------------------------------------------------------------------------------
        //  constructor
        //  コンストラクタ
        //  构造函数
        //--------------------------------------------------------------------------------
        MainSystem(HINSTANCE instance_handle);

        //--------------------------------------------------------------------------------
        //  destructor
        //  デストラクタ
        //  析构函数
        //--------------------------------------------------------------------------------
        ~MainSystem();

        //--------------------------------------------------------------------------------
        //  delete the copy constructor and operator
        //  コピーコンストラクタとオペレーターの削除
        //  删除复制用构造函数与等号
        //--------------------------------------------------------------------------------
        MainSystem() = delete;
        MainSystem(MainSystem const&) = delete;
        void operator=(MainSystem const&) = delete;

        //--------------------------------------------------------------------------------
        //  initialize the instance
        //  Arguments :
        //  Return：true when succeeded, else false
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  初期化処理
        //  引数 :
        //  戻り値：成功したらtrue、失敗したらfalse
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  初始化
        //  参数 :
        //  返回值：成功则返回true、反之返回false
        //--------------------------------------------------------------------------------
        bool Initialize() override;

        //--------------------------------------------------------------------------------
        //  Uninit the instance
        //  Arguments :
        //  Return：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  インスタンスの終了処理
        //  引数 :
        //  戻り値：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  终了处理
        //  参数 :
        //  返回值：
        //--------------------------------------------------------------------------------
        void Uninitialize() override;

        //--------------------------------------------------------------------------------
        //  Get the os' user language
        //  Arguments :
        //  Return：true when succeeded, else false
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  OSの言語を取得
        //  引数 :
        //  戻り値：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  取得OS的语言
        //  参数 :
        //  返回值：
        //--------------------------------------------------------------------------------
        void GetSystemLanguage();

        //--------------------------------------------------------------------------------
        //  Initialize game window
        //  Arguments :
        //  Return：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  ウインドウ初期化処理
        //  引数 :
        //  戻り値：成功したらtrue、失敗したらfalse
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  窗口初始化
        //  参数 :
        //  返回值：成功则返回true、反之返回false
        //--------------------------------------------------------------------------------
        bool InitializeWindow();

        //--------------------------------------------------------------------------------
        //  Call the game systems' update function
        //  Arguments :
        //  Return：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  ゲームシステムの更新
        //  引数 :
        //  戻り値：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  取得OS的语言
        //  参数 :
        //  返回值：
        //--------------------------------------------------------------------------------
        void Update();

        //--------------------------------------------------------------------------------
        //  Render the current scene
        //  Arguments :
        //  Return：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  描画処理
        //  引数 :
        //  戻り値：
        //ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
        //  描画处理
        //  参数 :
        //  返回值：
        //--------------------------------------------------------------------------------
        void Render();

        //--------------------------------------------------------------------------------
        //  const variable / 定数 / 定量
        //--------------------------------------------------------------------------------
        static constexpr UINT kDefaultWidth = 1280;
        static constexpr UINT kDefaultHeight = 720;

        //--------------------------------------------------------------------------------
        //  variable / 変数 / 变量
        //--------------------------------------------------------------------------------
        HINSTANCE instance_handle_;
        HWND      main_window_handle_;
        bool      paused_;
        bool      minimized_;
        bool      maximized_;
        bool      resizing_;
        bool      fullscreen_state_;
        UINT      width_;
        UINT      height_;
        Language  current_language_;
    };
}